In [ ]:
import pandas as pd
import numpy as np


**Try with the [E-commerce Dataset](https://www.kaggle.com/mkechinov/ecommerce-behavior-data-from-multi-category-store)?**
---

In [ ]:
df_t= pd.read_csv('titanic.csv')

In [ ]:
df_t=df_t.drop(['Name', 'SibSp', 'Parch','Ticket', 'Cabin', 'Embarked'], axis=1)

In [ ]:
df_t.head(5)

   PassengerId  Survived  Pclass     Sex   Age     Fare
0            1         0       3    male  22.0   7.2500
1            2         1       1  female  38.0  71.2833
2            3         1       3  female  26.0   7.9250
3            4         1       1  female  35.0  53.1000
4            5         0       3    male  35.0   8.0500

In [ ]:
df_t.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass     Sex   Age     Fare
0              1         0       3    male  22.0   7.2500
1              2         1       1  female  38.0  71.2833
2              3         1       3  female  26.0   7.9250
3              4         1       1  female  35.0  53.1000
4              5         0       3    male  35.0   8.0500
..           ...       ...     ...     ...   ...      ...
886          887         0       2    male  27.0  13.0000
887          888         1       1  female  19.0  30.0000
888          889         0       3  female   NaN  23.4500
889          890         1       1    male  26.0  30.0000
890          891         0       3    male  32.0   7.7500

[891 rows x 6 columns]>

In [ ]:
df_t.drop(['PassengerId'], axis=1, inplace=True)

In [ ]:
df_t.head(2)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833

In [ ]:
from sklearn.tree import DecisionTreeClassifier # Import Decision Tree Classifier
from sklearn.model_selection import train_test_split # Import train_test_split function
from sklearn import metrics #Import scikit-learn metrics module for accuracy calculation
from sklearn.preprocessing import LabelEncoder

In [ ]:
le_sex= LabelEncoder()

In [ ]:
df_t['enc_sex']= le_sex.fit_transform(df_t['Sex'])

In [ ]:
df_t.head(4)

   Survived  Pclass     Sex   Age     Fare  enc_sex
0         0       3    male  22.0   7.2500        1
1         1       1  female  38.0  71.2833        0
2         1       3  female  26.0   7.9250        0
3         1       1  female  35.0  53.1000        0

In [ ]:
df_t[df_t.isna().any(axis=1)]

     Survived  Pclass     Sex  Age     Fare  enc_sex
5           0       3    male  NaN   8.4583        1
17          1       2    male  NaN  13.0000        1
19          1       3  female  NaN   7.2250        0
26          0       3    male  NaN   7.2250        1
28          1       3  female  NaN   7.8792        0
..        ...     ...     ...  ...      ...      ...
859         0       3    male  NaN   7.2292        1
863         0       3  female  NaN  69.5500        0
868         0       3    male  NaN   9.5000        1
878         0       3    male  NaN   7.8958        1
888         0       3  female  NaN  23.4500        0

[177 rows x 6 columns]

In [ ]:
df_t['Age'] = df_t['Age'].fillna(method='ffill').fillna(method='bfill')

In [ ]:
df_t[df_t.isna().any(axis=1)]

Empty DataFrame
Columns: [Survived, Pclass, Sex, Age, Fare, enc_sex]
Index: []

In [ ]:
#split dataset in features and target variable
feature_col= ['Pclass', 'enc_sex', 'Age' ,'Fare']
target=df_t.Survived
f_cols=df_t[feature_col]

In [ ]:
#diving the dataset into train and test set
X_train, X_test, y_train, y_test = train_test_split(f_cols, target, test_size=0.3, random_state=1) # 70% training and 30% test

In [ ]:
clf= DecisionTreeClassifier() #Creating a decison tree object
clf.fit(X_train, y_train) #Training the Decision Tree Model on the training set

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
clf.score(X_train, y_train)

0.985553772070626

In [ ]:
#Predict the response for test dataset
y_pred = clf.predict(X_test)

In [ ]:
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.7313432835820896

Really Nice Read : [Here](https://www.datacamp.com/community/tutorials/decision-tree-classification-python)

# **Visualization on the Decision Tree**